export const Greeting = "안녕하세요. 앱, 백엔드, 서버개발자 추희도 입니다.";
export const Introduction = [
    "저는 초등학교 2학년때 처음 스크래치를 접하며 코딩의 매력에 빠져왔습니다. 초등학교 3학년때에는 앱 인벤터를, 중학교 1학년때에는 Python을 처음 접했습니다. ",
    "고등학교 1학년인 2023년 4월에는 Android 개발을 배우기 위해 Java를 독학으로 배우기 시작했습니다.",
    "처음에는 계획없이 마구잡이로 학습을 하는 바람에 난향을 겪었습니다. 하지만 수많은 경험과 시도 끝에 Java를 배운지 2개월만에 Stream과 Async, OOP를 이해했고, 3개월차에는 Android 개발을 이해했습니다.",
    "저는 Android 앱을 만들면서 만든 앱을 배포할때 Android 앱만으로는 부족하다고 생각했기에 Swift로 iOS 앱개발을 하려 했지만 개발 환경이 허락하지 않았고, ",
    "저는 Cross Platform 앱 개발 Framework인 React-Native와 Flutter로 눈을 돌렸습니다.",
    "저는 Flutter와 React-Native로 같은 프로젝트를 만들며 뭐가 더 저에게 잘 맞는지 찾아갔습니다. 그 결과, 저는 저에게 Flutter가 더 잘 맞는다 생각하여 그 뒤로도 Flutter를 꾸준히 연습했습니다. ",
    "저는 여기서 그치지 않고 2023년 8월에 있었던 Junction Asia 2023을 지원하고자, 웹으로 포트폴리오를 만들기 위해서 React-Native를 했던 경험을 살려, React-JS로 포트폴리오를 만들었습니다.",
    "Junction Asia를 지원할때 저와 친구들은 입상은 기대하지 말고 경험을 쌓는걸 중요하게 생각하자곤 했었습니다. ",
    "그러나 제가 속한 저희 팀은 트랙 3위를 달성하여 최초 고등학생 수상, 최연소 수상이라는 두가지의 타이틀을 따냈습니다.",
    "그 뒤로도 저는 꾸준히 제 실력을 키우기 위해 mySQL, MongoDB, Node-JS등으로 서버와 데이터베이스 구축, 정보보안, Spring-Boot와 같은 새로운 언어와 Framework들을 학습했습니다.",
    "제가 코딩을 할때에는 팀원들과의 협업, 협력이 기능 구현보다 더 중요하다고 생각하기 때문에 코드 유지보수, 가독성을 최우선시하며 코드를 작성하곤 합니다.",
    "이러한 노력과 성취들로 미래의 발전 가능성은 무궁무진하다고 자신할 수 있습니다. 계속해서 새로운 기술과 언어를 배워나가며 코딩의 깊이와 폭을 넓혀가고자 합니다. ",
    "끊임없는 도전과 열정으로 새로운 프로젝트를 성공적으로 이끌어내고, 혁신적인 아이디어를 구현해내는 개발자로 성장하고 싶습니다. ",
    "이러한 지속적인 학습 의지로 인해 코딩의 세계에서 더욱 높은 수준으로 도약할 수 있을 것입니다."
].join('\n');

export const Phone = "+82 10-8127-7180";
export const Instagram = "@void___main";
export const Email = "manner0814@sjhansol.sjeduhs.kr";
